Комплексная_автоматизация_2_МОМ_2019/src/InformationRegisters/МестаВыплатыЗарплатыПодразделений/МестаВыплатыЗарплатыПодразделений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МестаВыплатыЗарплатыПодразделений</name>
  <resources>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидыМестВыплатыЗарплаты</types>
    </type>
  </resources>
  <resources>
    <name>МестоВыплаты</name>
    <type>
      <types>DefinedType.МестоВыплатыЗарплатыСотрудников</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Комплексная_автоматизация_2_МОМ_2019/src/Enums/ВидыМестВыплатыЗарплаты/ВидыМестВыплатыЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыМестВыплатыЗарплаты</name>
  <enumValues>
    <name>Касса</name>
    <comment>АПК:58</comment>
  </enumValues>
  <enumValues>
    <name>ЗарплатныйПроект</name>
    <comment>АПК:58</comment>
  </enumValues>
  <enumValues>
    <name>Раздатчик</name>
    <comment>АПК:58</comment>
  </enumValues>
  <enumValues>
    <name>БанковскийСчет</name>
    <comment>АПК:58</comment>
  </enumValues>
</mdclass:Enum>

Комплексная_автоматизация_2_МОМ_2019/src/InformationRegisters/МестаВыплатыЗарплатыПодразделений/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает допустимые значения видов мест выплаты зарплаты подразделений.
//
// Возвращаемое значение:
//	Массив - элементы типа ПеречислениеСсылка.ВидыМестВыплатыЗарплаты.
//
Функция ДопустимыеВидыМестВыплаты() Экспорт
	
	ДопустимыеВидыМестВыплаты = Новый Массив;
	ДопустимыеВидыМестВыплаты.Добавить(Перечисления.ВидыМестВыплатыЗарплаты.ЗарплатныйПроект);
	ДопустимыеВидыМестВыплаты.Добавить(Перечисления.ВидыМестВыплатыЗарплаты.Касса);
	ДопустимыеВидыМестВыплаты.Добавить(Перечисления.ВидыМестВыплатыЗарплаты.Раздатчик);

	Возврат ДопустимыеВидыМестВыплаты
	
КонецФункции	

#КонецОбласти

#КонецЕсли
